package epay

import (
	"encoding/json"
	"errors"
	"html/template"
	"net/http"
	"os"
	"path/filepath"
	"strings"
	"time"

	"github.com/shopspring/decimal"
)

var ErrFromEpay = errors.New("Произошла ошибка при попытке оплаты, проверьте статус")

func (c *Client) InitTokenRefresher() (err error) {
	if err = c.updateToken(); err != nil {
		return
	}

	ticker := time.Duration(c.credential.ExpiresIn - 60)
	timer := time.NewTicker(ticker * time.Second)

	go func() {
		for {
			<-timer.C

			err = c.updateToken()
			if err != nil {
				return
			}
		}
	}()

	return
}

func (c *Client) PayByTemplate(w http.ResponseWriter, requestSrc Request) (err error) {
	rootDir, err := os.Getwd()
	if err != nil {
		return
	}

	if requestSrc.DueDate != nil && requestSrc.Status.Transaction.StatusName == "" {
		localtime := time.Now().Add(6 * time.Hour)
		dueTime := requestSrc.DueDate.Add(-1500 * time.Second)

		if localtime.Unix() > dueTime.Unix() {
			requestSrc.Status.Transaction.StatusName = "EXPIRED"
			requestSrc.Status.Transaction.StatusTitle = "Истек срок оплаты"

			requestSrc.Status.Transaction.Amount, err = decimal.NewFromString(requestSrc.Amount)
			if err != nil {
				return
			}
		}
	}

	filenames := ""
	switch requestSrc.Status.Transaction.StatusName {
	case "NEW", "AUTH", "EXPIRED":
		requestSrc.Status.Transaction.Status = "pending"
		filenames = filepath.Join(rootDir, "templates", "status.html")
	case "CHARGE":
		requestSrc.Status.Transaction.Status = "success"
		filenames = filepath.Join(rootDir, "templates", "status.html")

		if strings.Contains(requestSrc.Description, "15 ₸") {
			filenames = filepath.Join(rootDir, "templates", "redirect.html")
		}
	case "CANCEL", "CANCEL_OLD", "REFUND":
		requestSrc.Status.Transaction.Status = "cancel"
		filenames = filepath.Join(rootDir, "templates", "status.html")
	case "REJECT", "FAILED", "3D":
		requestSrc.Status.Transaction.Status = "failed"
		filenames = filepath.Join(rootDir, "templates", "status.html")
	case "":
		filenames = filepath.Join(rootDir, "templates", "payment.html")

		token, err := c.getToken(requestSrc)
		if err != nil {
			return err
		}

		requestSrc.Token = token
		requestSrc.PaymentJsLink = c.credential.JS

		requestSrc.BackLink = c.configs.APP.Host + "/invoices/" + requestSrc.ID + "/pay"

	default:
		requestSrc.Status.Transaction.Status = "failed"
		filenames = filepath.Join(rootDir, "templates", "status.html")
	}

	requestSrc.Status.Transaction.Date = requestSrc.Status.Transaction.CreatedDate.Format("02.01.2006 15:04")
	if requestSrc.Status.Transaction.StatusName == "EXPIRED" {
		requestSrc.Status.Transaction.Date = requestSrc.DueDate.Format("02.01.2006 15:04")
	}

	tmpl, err := template.ParseFiles(filenames)
	if err != nil {
		return
	}

	return tmpl.Execute(w, requestSrc)
}

func (c *Client) PayByCard(requestSrc Request) (responseSrc *ResponseCardID, err error) {
	token, err := c.getToken(requestSrc)
	if err != nil {
		return
	}

	req, err := parseToRequestByCardID(requestSrc)
	if err != nil {
		return
	}

	path := c.credential.Endpoint + "/payments/cards/auth"
	resBytes, status, err := c.handler("POST", path, "", token.AccessToken, req, true)
	if err != nil {
		return
	}

	switch status {
	case http.StatusOK:
		err = json.Unmarshal(resBytes, &responseSrc)
	default:
		if ok := json.Unmarshal(resBytes, &responseSrc); ok != nil {
			err = errors.New(string(resBytes))
			return
		}

		err = ErrFromEpay
		return
	}

	return
}

func parseToRequestByCardID(data Request) (res RequestByCardID, err error) {
	_, err = decimal.NewFromString(data.Amount)
	if err != nil {
		return
	}

	return RequestByCardID{
		ID:          data.ID,
		IIN:         data.IIN,
		InvoiceID:   data.InvoiceID,
		Amount:      0.00,
		Currency:    data.Currency,
		TerminalID:  data.TerminalID,
		Description: data.Description,
		AccountID:   data.AccountID,
		Name:        data.Name,
		CardID:      data.CardID,
		PostLink:    data.PostLink,
		PaymentType: "cardId",
		Data:        data.Data,
	}, nil
}

func (c *Client) Charge(transactionID, amount string) (err error) {
	path := c.credential.Endpoint + "/operation/" + transactionID + "/charge"

	resBytes, status, err := c.handler("POST", path, "", "", map[string]string{
		"amount": amount,
	}, true)
	if err != nil {
		return
	}

	if status != http.StatusOK {
		err = errors.New(string(resBytes))
	}

	return
}

func (c *Client) Cancel(transactionID string) (err error) {
	path := c.credential.Endpoint + "/operation/" + transactionID + "/cancel"

	resBytes, status, err := c.handler("POST", path, "", "", nil, true)
	if err != nil {
		return
	}

	if status != http.StatusOK {
		err = errors.New(string(resBytes))
	}

	return
}

func (c *Client) CheckStatus(invoiceID, terminalID string) (res StatusResponse, err error) {
	token, err := c.getToken(Request{TerminalID: terminalID})
	if err != nil {
		return
	}

	path := c.credential.Endpoint + "/check-status/payment/transaction/" + invoiceID
	resBytes, status, err := c.handler("GET", path, "", token.AccessToken, nil, true)
	if err != nil {
		return
	}

	switch status {
	case http.StatusOK, http.StatusBadRequest:
		if err = json.Unmarshal(resBytes, &res); err != nil {
			return
		}

		res.Transaction.StatusDescription = GetDescriptionTitle(res.Transaction.ReasonCode, res.Transaction.Language)
		res.Transaction.StatusTitle = GetStatusTitle(res.Transaction.StatusName, res.Transaction.Language)

		if res.Transaction.StatusName == "AUTH" || res.Transaction.StatusName == "CHARGE" {
			res.Transaction.StatusDescription = ""
		}

	default:
		err = errors.New(string(resBytes))
	}

	return
}

func GetDescriptionTitle(reasonCode, lang string) (description string) {
	lang = normalizeLang(lang)

	if descLangMap, ok := descriptionTranslations[reasonCode]; ok {
		if desc, exists := descLangMap[lang]; exists {
			return desc + " (" + reasonCode + ")"
		}
	}

	return descriptionTranslations["2660"][lang] + " (" + reasonCode + ")"
}

func GetStatusTitle(statusName, lang string) string {
	lang = normalizeLang(lang)

	if translations, ok := statusTranslations[statusName]; ok {
		if title, exists := translations[lang]; exists {
			return title
		}
	}

	return statusTranslations["REJECT"][lang]
}

func normalizeLang(lang string) string {
	if lang == "" {
		return "rus"
	}

	lang = strings.ToLower(lang)
	switch lang {
	case "ru", "rus":
		return "rus"
	case "kz", "kaz":
		return "kaz"
	default:
		return "eng"
	}
}

var statusTranslations = map[string]map[string]string{
	"REFUND": {
		"rus": "Средства возвращены",
		"kaz": "Ақша қайтарылды",
	},
	"AUTH": {
		"rus": "Средства временно заблокированы",
		"kaz": "Ақша уақытша бұғатталды",
	},
	"CANCEL": {
		"rus": "Средства разблокированы",
		"kaz": "Ақша босатылды",
	},
	"CHARGE": {
		"rus": "Оплата прошла успешно",
		"kaz": "Төлем сәтті өтті",
	},
	"VERIFIED": {
		"rus": "Карта действительная и может использоваться для платежей",
		"kaz": "Карта жарамды және төлемдер үшін пайдалануға болады",
	},
	"CANCEL_OLD": {
		"rus": "Средства разблокированы",
		"kaz": "Ақша босатылды",
	},
	"FAILED": {
		"rus": "Транзакция неудачна",
		"kaz": "Транзакция сәтсіз аяқталды",
	},
	"FINGERPRINT": {
		"rus": "Идет проверка данных перед подтверждением платежа",
		"kaz": "Төлемді растау алдында деректер тексерілуде",
	},
	"3D": {
		"rus": "Ошибка 3D-проверки",
		"kaz": "3D тексеру қатесі",
	},
	"NEW": {
		"rus": "Транзакция в обработке",
		"kaz": "Транзакция өңдеуде",
	},
	"REJECT": {
		"rus": "Платеж отклонен",
		"kaz": "Төлем қабылданбады",
	},
}

var descriptionTranslations = map[string]map[string]string{
	"100": {
		"rus": "Системная ошибка",
		"kaz": "Жүйелік қате",
	},
	"293": {
		"rus": "Техническая ошибка",
		"kaz": "Техникалық қате",
	},
	"454": {
		"rus": "Операция не удалась, проверьте, не заблокирована ли сумма на карте и повторите попытку позже",
		"kaz": "Операция сәтсіз аяқталды, картада қаражат бұғатталмағанын тексеріп, кейінірек қайтадан байқап көріңіз",
	},
	"455": {
		"rus": "Проверка 3DSecure/Securecode недоступна, либо неверно введен номер карты. Попробуйте воспользоваться другим браузером/устройством. Если ошибка повторяется, переустановите код",
		"kaz": "3DSecure/Securecode тексеруі қолжетімді емес немесе карта нөмірі дұрыс енгізілмеген. Басқа браузер/құрылғыны пайдаланып көріңіз. Қате қайталанса, кодты қайта орнатыңыз",
	},
	"456": {
		"rus": "Системная ошибка, попробуйте позже, если ошибка сохраняется, обратитесь в компанию",
		"kaz": "Жүйелік қате, кейінірек қайтадан байқап көріңіз, егер қате сақталса, компанияға хабарласыңыз",
	},
	"457": {
		"rus": "Некорректно введен срок действия карты",
		"kaz": "Карта мерзімі дұрыс енгізілмеген",
	},
	"458": {
		"rus": "Сервер не отвечает. Попробуйте попозже",
		"kaz": "Сервер жауап бермейді. Кейінірек қайтадан байқап көріңіз",
	},
	"459": {
		"rus": "Проверьте корректность номера карты и что вы вводите его в правильное поле формы оплаты",
		"kaz": "Карта нөмірінің дұрыстығын және оны төлем формасының дұрыс өрісіне енгізгеніңізді тексеріңіз",
	},
	"460": {
		"rus": "Произошла ошибка, возможно сумма заблокировалась на карте, обратитесь службу поддержки",
		"kaz": "Қате орын алды, мүмкін картадағы сома бұғатталған болар, қолдау қызметіне хабарласыңыз",
	},
	"461": {
		"rus": "Системная ошибка, попробуйте провести транзакцию позже, если ошибка повторяется обратитесь в службу поддержки",
		"kaz": "Жүйелік қате, транзакцияны кейінірек қайтадан байқап көріңіз, егер қате қайталанса, қолдау қызметіне хабарласыңыз",
	},
	"462": {
		"rus": "Транзакция отклонена вашим банком. Для уточнения причины отказа необходимо обратиться по контактам, указанным на обратной стороне вашей карты",
		"kaz": "Сіздің банкіңіз транзакцияны қабылдамады. Себебін анықтау үшін картаңыздың арт жағындағы контактілерге хабарласыңыз",
	},
	"463": {
		"rus": "Транзакция отклонена вашим банком. Для уточнения причины отказа необходимо обратиться по контактам, указанным на обратной стороне вашей карты",
		"kaz": "Сіздің банкіңіз транзакцияны қабылдамады. Себебін анықтау үшін картаңыздың арт жағындағы контактілерге хабарласыңыз",
	},
	"464": {
		"rus": "Недействительный коммерсант",
		"kaz": "Жарамсыз коммерсант",
	},
	"465": {
		"rus": "Карта заблокирована",
		"kaz": "Карта бұғатталды",
	},
	"466": {
		"rus": "Транзакция отклонена вашим банком. Для уточнения причины отказа необходимо обратиться по контактам, указанным на обратной стороне вашей карты",
		"kaz": "Сіздің банкіңіз транзакцияны қабылдамады. Себебін анықтау үшін картаңыздың арт жағындағы контактілерге хабарласыңыз",
	},
	"467": {
		"rus": "Карта заблокирована",
		"kaz": "Карта бұғатталды",
	},
	"468": {
		"rus": "Требуется дополнительная идентификация",
		"kaz": "Қосымша идентификация қажет",
	},
	"469": {
		"rus": "Недействительная транзакция, перепроверить введенные данные",
		"kaz": "Жарамсыз транзакция, енгізілген мәліметтерді қайта тексеріңіз",
	},
	"470": {
		"rus": "Сумма транзакции равно нулю, пожалуйста, попробуйте ещё раз",
		"kaz": "Транзакция сомасы нөлге тең, қайтадан байқап көріңіз",
	},
	"471": {
		"rus": "Недействительный номер карточки, пожалуйста, убедитесь в корректности ввода номера карты и попробуйте ещё раз",
		"kaz": "Карта нөмірі жарамсыз, карта нөмірін дұрыс енгізгеніңізге көз жеткізіп, қайтадан байқап көріңіз",
	},
	"472": {
		"rus": "Недействительный номер карточки, пожалуйста, убедитесь в корректности ввода номера карты и попробуйте ещё раз",
		"kaz": "Карта нөмірі жарамсыз, карта нөмірін дұрыс енгізгеніңізге көз жеткізіп, қайтадан байқап көріңіз",
	},
	"473": {
		"rus": "3DSecure/Securecode введен или введен некорректно. Пожалуйста, убедитесь в корректности ввода, либо переустановите пароль. Если ошибка повторяется обратитесь в службу поддержки",
		"kaz": "3DSecure/Securecode дұрыс енгізілмеген немесе енгізілген, дұрыс енгізгеніңізге көз жеткізіңіз, немесе құпиясөзді қайта орнатыңыз. Қате қайталанса, қолдау қызметіне хабарласыңыз",
	},
	"475": {
		"rus": "Транзакция не успешна. Пожалуйста, повторите снова",
		"kaz": "Транзакция сәтсіз аяқталды. Қайтадан байқап көріңіз",
	},
	"476": {
		"rus": "Повторное проведение транзакции будет доступно не менее чем через 30 минут",
		"kaz": "Транзакцияны қайталау кем дегенде 30 минуттан кейін қолжетімді болады",
	},
	"477": {
		"rus": "Ошибка, пожалуйста, воспользуйтесь другой картой. В случае её отсутствия обратитесь в службу поддержки по адресу epay@halykbank.kz",
		"kaz": "Қате, басқа картаны пайдаланыңыз. Егер ол болмаса, epay@halykbank.kz мекенжайы бойынша қолдау қызметіне хабарласыңыз",
	},
	"478": {
		"rus": "Просрочен срок действия карты",
		"kaz": "Карта мерзімі аяқталды",
	},
	"479": {
		"rus": "Карточка заблокирована",
		"kaz": "Карта бұғатталды",
	},
	"480": {
		"rus": "Обратиться к банку - эмитенту",
		"kaz": "Банк-эмитентке хабарласыңыз",
	},
	"481": {
		"rus": "Карта недействительна. Пожалуйста, обратитесь в Банк для выпуска новой карты",
		"kaz": "Карта жарамсыз. Жаңа карта шығару үшін банкке хабарласыңыз",
	},
	"482": {
		"rus": "Карта недействительна. Пожалуйста, обратитесь в Банк для выпуска новой карты",
		"kaz": "Карта жарамсыз. Жаңа карта шығару үшін банкке хабарласыңыз",
	},
	"483": {
		"rus": "Статус карты - украдена. Пожалуйста, обратитесь в Банк для выпуска новой карты",
		"kaz": "Карта ұрланған. Жаңа карта шығару үшін банкке хабарласыңыз",
	},
	"484": {
		"rus": "Недостаточно средств на карте",
		"kaz": "Картада жеткілікті қаражат жоқ",
	},
	"485": {
		"rus": "Срок действия карты истек",
		"kaz": "Карта мерзімі өтіп кетті",
	},
	"486": {
		"rus": "Транзакция отклонена. На карте запрещена возможность покупок в сети интернет, либо карточные данные введены не верно",
		"kaz": "Транзакция қабылданбады. Картада интернет арқылы төлем жасау мүмкіндігі шектелген немесе карта мәліметтері дұрыс енгізілмеген",
	},
	"487": {
		"rus": "Транзакция отклонена, пожалуйста, обратитесь в службу поддержки",
		"kaz": "Транзакция қабылданбады, қолдау қызметіне хабарласыңыз",
	},
	"488": {
		"rus": "Сумма превышает допустимый лимит",
		"kaz": "Сома рұқсат етілген шектен асқан",
	},
	"489": {
		"rus": "Карточка заблокирована",
		"kaz": "Карта бұғатталды",
	},
	"490": {
		"rus": "Запрет на проведение транзакции по вашей карте, за дополнительной информацией обратитесь по контактам, указанным на обратной стороне вашей карты",
		"kaz": "Сіздің картаңызбен транзакция жүргізуге тыйым салынған, қосымша ақпарат алу үшін картаңыздың арт жағындағы контактілерге хабарласыңыз",
	},
	"491": {
		"rus": "Превышен лимит частоты оплат",
		"kaz": "Төлемдер жиілігінің шегі асып кетті",
	},
	"492": {
		"rus": "Карта заблокирована по причине неверного ввода пин-кода, за дополнительной информацией обратитесь по контактам, указанным на обратной стороне вашей карты",
		"kaz": "ПИН-кодтың дұрыс енгізілмеуіне байланысты карта бұғатталды, қосымша ақпарат алу үшін картаңыздың арт жағындағы контактілерге хабарласыңыз",
	},
	"493": {
		"rus": "Недоступен банк, выпустивший карту, попробуйте повторить оплату позже",
		"kaz": "Картаны шығарған банк қолжетімсіз, төлемді кейінірек қайталап көріңіз",
	},
	"494": {
		"rus": "Недоступен банк, выпустивший карту, попробуйте провести транзакцию позже",
		"kaz": "Картаны шығарған банк қолжетімсіз, транзакцияны кейінірек қайталап көріңіз",
	},
	"495": {
		"rus": "Транзакция запрещена, воспользуйтесь другой картой",
		"kaz": "Транзакцияға тыйым салынған, басқа картаны қолданыңыз",
	},
	"496": {
		"rus": "Системная ошибка",
		"kaz": "Жүйелік қате",
	},
	"497": {
		"rus": "Сервер не отвечает. Попробуйте попозже",
		"kaz": "Сервер жауап бермейді. Кейінірек қайталап көріңіз",
	},
	"498": {
		"rus": "Оплата бонусами невозможна. Попробуйте попозже",
		"kaz": "Бонустармен төлем жасау мүмкін емес. Кейінірек қайталап көріңіз",
	},
	"499": {
		"rus": "Неверно введен или не введен 3DSecure/Securecode",
		"kaz": "3DSecure/Securecode дұрыс енгізілмеген немесе енгізілмеген",
	},
	"500": {
		"rus": "Проверка 3DSecure недоступна, попробуйте сменить точку доступа в интернет или смените устройство",
		"kaz": "3DSecure тексеруі қолжетімді емес, интернетке қосылу нүктесін немесе құрылғыны өзгеріп көріңіз",
	},
	"501": {
		"rus": "Ошибка обслуживания карты. Проверьте правильность ввода карты. Если ошибка повторяется, обратитесь в службу поддержки",
		"kaz": "Карта қызмет көрсету қатесі. Карта мәліметтерін дұрыстығын тексеріңіз. Қате қайталанса, қолдау қызметіне хабарласыңыз",
	},
	"502": {
		"rus": "Сервер не отвечает. Попробуйте попозже",
		"kaz": "Сервер жауап бермейді. Кейінірек қайталап көріңіз",
	},
	"503": {
		"rus": "Данный вид операции требует обязательного использования 3DSecure пароля, уточните в своем банке как использовать 3DSecure пароль по вашей карте",
		"kaz": "Осы операция түрі 3DSecure құпиясөзін міндетті қолдануды талап етеді, картаңыз бойынша 3DSecure құпиясөзін қалай қолдану керектігін банкіңізден анықтаңыз",
	},
	"521": {
		"rus": "Транзакция отклонена вашим банком. Для уточнения причины отказа необходимо обратиться по контактам, указанным на обратной стороне вашей карты",
		"kaz": "Сіздің банкіңіз транзакцияны қабылдамады. Себебін анықтау үшін картаңыздың арт жағындағы контактілерге хабарласыңыз",
	},
	"522": {
		"rus": "Запись не найдена, проверьте карточку",
		"kaz": "Жазба табылмады, картаны тексеріңіз",
	},
	"523": {
		"rus": "Транзакция отклонена вашим банком. Для уточнения причины отказа необходимо обратиться по контактам, указанным на обратной стороне вашей карты",
		"kaz": "Сіздің банкіңіз транзакцияны қабылдамады. Себебін анықтау үшін картаңыздың арт жағындағы контактілерге хабарласыңыз",
	},
	"525": {
		"rus": "Карта недействительна. Пожалуйста, обратитесь в Банк",
		"kaz": "Карта жарамсыз. Банкке хабарласыңыз",
	},
	"526": {
		"rus": "Системная ошибка. Пожалуйста, попробуйте позднее. Если эта проблема не исчезнет, обратитесь в службу поддержки",
		"kaz": "Жүйелік қате. Кейінірек қайталап көріңіз. Егер бұл мәселе шешілмесе, қолдау қызметіне хабарласыңыз",
	},
	"527": {
		"rus": "Транзакция отклонена вашим банком. Для уточнения причины отказа необходимо обратиться по контактам, указанным на обратной стороне вашей карты",
		"kaz": "Сіздің банкіңіз транзакцияны қабылдамады. Себебін анықтау үшін картаңыздың арт жағындағы контактілерге хабарласыңыз",
	},
	"528": {
		"rus": "Превышен суточный лимит входящих переводов на карту получателя, предоставьте другую карту для перевода",
		"kaz": "Алушының картасына кіретін аударымдардың күндік шегі асып кетті, аудару үшін басқа картаны ұсыныңыз",
	},
	"529": {
		"rus": "Сработал суточный лимит на терминале",
		"kaz": "Терминалда күндік шек іске қосылды",
	},
	"690": {
		"rus": "Не смогли получить операции мерчанта, запросите статус операции",
		"kaz": "Сатушының операцияларын ала алмай қалдық, операцияның статусын сұраңыз",
		"eng": "Could not retrieve merchant operations, request operation status",
	},
	"877": {
		"rus": "Невозможно завершить проверку 3DSecure",
		"kaz": "3DSecure тексеруін аяқтау мүмкін емес",
	},
	"1266": {
		"rus": "Техническая ошибка",
		"kaz": "Техникалық қате",
	},
	"1267": {
		"rus": "Ошибка связи с карточной системой",
		"kaz": "Карталық жүйемен байланыс қатесі",
	},
	"1268": {
		"rus": "Техническая ошибка",
		"kaz": "Техникалық қате",
	},
	"1269": {
		"rus": "Техническая ошибка",
		"kaz": "Техникалық қате",
	},
	"1563": {
		"rus": "Ошибка выполнения HTTP-запроса",
		"kaz": "HTTP-сұранысын орындау қатесі",
		"eng": "HTTP request execution error",
	},
	"1564": {
		"rus": "Получен HTTP-ответ с неожиданным кодом",
		"kaz": "Күтпеген HTTP-жауап коды алынды",
	},
	"1565": {
		"rus": "Ошибка чтения HTTP-запроса",
		"kaz": "HTTP-сұранысты оқу қатесі",
	},
	"1568": {
		"rus": "Ошибка обработки ответа системы",
		"kaz": "Жүйе жауабын өңдеу қатесі",
	},
	"1569": {
		"rus": "Ошибка обновления данных транзакции",
		"kaz": "Транзакция деректерін жаңарту қатесі",
	},
	"1570": {
		"rus": "Ошибка сборки json ответа",
		"kaz": "JSON жауабын құрастыру қатесі",
	},
	"2032": {
		"rus": "Ошибка отправки результата",
		"kaz": "Нәтижені жіберу қатесі",
	},
	"2249": {
		"rus": "Ошибка чтения HTTP-запроса",
		"kaz": "HTTP-сұранысты оқу қатесі",
		"eng": "HTTP request reading error",
	},
	"2326": {
		"rus": "Ошибка чтения HTTP-запроса",
		"kaz": "HTTP-сұранысты оқу қатесі",
		"eng": "HTTP request reading error",
	},
	"2358": {
		"rus": "Ошибка при получении информации о карте",
		"kaz": "Карта ақпаратын алу кезінде қате",
		"eng": "Error retrieving card information",
	},
	"2678": {
		"rus": "Сработал лимит на терминале",
		"kaz": "Терминалда лимит іске қосылды",
	},
	"2740": {
		"rus": "Превышено количество неуспешных попыток оплат (допускается не более 15 неуспешных попыток в течение 30 дней), используйте другую карту или дождитесь обнуления счетчика блокировки (с момента первой неуспешной попытки оплатить за последние 30 дней)",
		"kaz": "15-тен астам сәтсіз төлем әрекеттері (30 күн ішінде) асып кетті, басқа картаны қолданыңыз немесе 30 күндік блоктау счеті нөлге дейін күтіңіз",
	},
	"2872": {
		"rus": "Получен критичный код отказа от вашего банка, карта не может быть использована для оплаты, воспользуйтесь другой картой для оплаты",
		"kaz": "Банкіңізден критикалық қабылдамау коды алынды, карта төлем үшін пайдаланылмайды, басқа картаны қолданыңыз",
	},
	"3014": {
		"rus": "Системная ошибка",
		"kaz": "Жүйелік қате",
	},
	"2357": {
		"rus": "Указанные ИИН и номер телефона не соответствуют друг другу в досье клиента",
		"kaz": "Берілген ЖСН мен телефон нөмірі клиенттің деректерінде сәйкес келмейді",
	},
	"2656": {
		"rus": "Техническая ошибка",
		"kaz": "Техникалық қате",
	},
	"2660": {
		"rus": "Техническая ошибка",
		"kaz": "Техникалық қате",
	},
	"3013": {
		"rus": "Техническая ошибка",
		"kaz": "Техникалық қате",
	},
	"3141": {
		"rus": "При получении данного кода ответа при выполнении возврата (Refund) подтвержденной суммы ошибка указывает на то, что на контракте сработал лимит для возврата, и необходимо пополнить счет.",
		"kaz": "Берілген кодты алу кезінде (Refund) расталған сома бойынша қайтару кезінде, келісімшартта қайтару лимиті іске қосылғанын және шотты толықтыру қажеттілігін көрсетеді.",
	},
	"3225": {
		"rus": "Возврат по QR в процессе",
		"kaz": "QR бойынша қайтару процесінде",
	},
	"3240": {
		"rus": "Повторить платеж",
		"kaz": "Қайта төлеу",
	},
	"3298": {
		"rus": "Поле описания(description) содержит слишком много символов. Укоротите текст до 125 латинских или 62 кириллических символов.",
		"kaz": "Сипаттама (description) өрісі тым көп таңбаларды қамтиды. Мәтінді 125 латын немесе 62 кириллица таңбаларына дейін қысқартыңыз.",
	},
}
